CANopenNode/CanOpenSTM32/source/CO_driver_stm32h735g-dk.c
/*
 * CAN module object for STM32H7xx FDCAN peripheral IP.
 *
 * This file is a template for other microcontrollers.
 *
 * @file        CO_driver.c
 * @ingroup     CO_driver
 * @author      Janez Paternoster
 * @copyright   2004 - 2020 Janez Paternoster
 *
 * This file is part of CANopenNode, an opensource CANopen Stack.
 * Project home page is <https://github.com/CANopenNode/CANopenNode>.
 * For more information on CANopen see <http://www.can-cia.org/>.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Implementation Author:               Tilen Majerle <tilen@majerle.eu>
 */
#include "301/CO_driver.h"
#include "stm32h7xx_hal.h"
#include "stm32h7xx_ll_rcc.h"

/**
 * \brief           Configuration structure for FDCAN
 */
typedef struct {
    uint16_t clk_presc;                         /*!< Clock prescaler. Can be a any even number between `1` and `30`,
                                                        including `1`, indicating no prescaler */
    struct {
        uint16_t clk_presc;                     /*!< Block generator clock prescaler.
                                                        Can be any value between `1` and `512` for nominal
                                                        and any value between `1` and `32` for data */
        uint16_t swj;                           /*!< Number of SWJ Time-Quantas.
                                                        Can be any value between `1` and `128` for nominal
                                                        and any value between `1` and `16` for data */
        uint16_t ts1;                           /*!< Number of TS1 Time-Quantas.
                                                        Can be any value between `2` and `256` for nominal
                                                        and any value between `1` and `32` for data */
        uint16_t ts2;                           /*!< Number of TS2 Time-Quantas.
                                                        Can be any value between `2` and `128` for nominal
                                                        and any value between `1` and `16` for data */
    } br_nominal;
} fdcan_br_cfg_t;

/* Get FDCAN handle from CANptr variable */
#define GET_FDCAN_HANDLE(CANptr)        ((CANptr) != NULL ? (CANptr) : &hfdcan1)

/* FDCAN1 handle */
FDCAN_HandleTypeDef hfdcan1;                    /* Global FDCAN instance for HAL */
static CO_CANmodule_t* CANModule_local = NULL;  /* Local instance of global CAN module */

/* CAN masks for identifiers */
#define CANID_MASK                              0x07FF  /*!< CAN standard ID mask */
#define FLAG_RTR                                0x8000  /*!< RTR flag, part of identifier */

#if defined(USE_OS)
/* Mutex for atomic access */
static osMutexId_t co_mutex;

/* Semaphore for main app thread synchronization */
osSemaphoreId_t co_drv_app_thread_sync_semaphore;

/* Semaphore for periodic thread synchronization */
osSemaphoreId_t co_drv_periodic_thread_sync_semaphore;
#endif /* defined(USE_OS) */

/*
 * Setup default config for 125kHz
 *
 * Settings assume FDCAN input kernel clock is 80 MHz.
 * See \ref fdcan_br_cfg_t for global options
 */
const static fdcan_br_cfg_t
fdcan_br_cfg = {
    .clk_presc = 4,                             /* Decrease input clock to 20 MHz */
    .br_nominal = {                             /* Configure br nominal to 125 kHz */
        .clk_presc = 8,                         /* Set nominal tq time to 2.5 MHz */
        .swj = 1,
        .ts1 = 16,
        .ts2 = 3
    },
};

/******************************************************************************/
void
CO_CANsetConfigurationMode(void *CANptr) {
    /* Put CAN module in configuration mode */
    HAL_FDCAN_Stop(GET_FDCAN_HANDLE(CANptr));
}

/******************************************************************************/
void
CO_CANsetNormalMode(CO_CANmodule_t *CANmodule) {
    /* Put CAN module in normal mode */
    if (HAL_FDCAN_Start(GET_FDCAN_HANDLE(CANmodule->CANptr)) == HAL_OK) {
        CANmodule->CANnormal = true;
    }
}

/******************************************************************************/
CO_ReturnError_t
CO_CANmodule_init(
        CO_CANmodule_t         *CANmodule,
        void                   *CANptr,
        CO_CANrx_t              rxArray[],
        uint16_t                rxSize,
        CO_CANtx_t              txArray[],
        uint16_t                txSize,
        uint16_t                CANbitRate)
{
    FDCAN_ClkCalUnitTypeDef fdcan_clk = {0};

    /* verify arguments */
    if (CANmodule == NULL || rxArray == NULL || txArray == NULL){
        return CO_ERROR_ILLEGAL_ARGUMENT;
    }

#if defined(USE_OS)
    /* Create new mutex for OS context */
    if (co_mutex == NULL) {
        const osMutexAttr_t attr = {
            .attr_bits = osMutexRecursive,
            .name = "co"
        };
        co_mutex = osMutexNew(&attr);
    }
    /* Semaphore for main app thread synchronization */
    if (co_drv_app_thread_sync_semaphore == NULL) {
        const osSemaphoreAttr_t attr = {
                .name = "co_app_thread_sync"
        };
        co_drv_app_thread_sync_semaphore = osSemaphoreNew(1, 1, &attr);
    }

    /* Semaphore for periodic thread synchronization */
    if (co_drv_periodic_thread_sync_semaphore == NULL) {
        const osSemaphoreAttr_t attr = {
                .name = "co_periodic_thread_sync"
        };
        co_drv_periodic_thread_sync_semaphore = osSemaphoreNew(1, 1, &attr);
    }
#endif /* defined(USE_OS) */

    /* Hold CANModule variable */
    CANModule_local = CANmodule;

    /* Configure object variables */
    CANmodule->CANptr = &hfdcan1;
    CANmodule->rxArray = rxArray;
    CANmodule->rxSize = rxSize;
    CANmodule->txArray = txArray;
    CANmodule->txSize = txSize;
    CANmodule->CANerrorStatus = 0;
    CANmodule->CANnormal = false;
    CANmodule->useCANrxFilters = false;             /* Do not use HW filters */
    CANmodule->bufferInhibitFlag = false;
    CANmodule->firstCANtxMessage = true;
    CANmodule->CANtxCount = 0U;
    CANmodule->errOld = 0U;

    /* Reset all variables */
    for (uint16_t i = 0U; i < rxSize; i++) {
        rxArray[i].ident = 0U;
        rxArray[i].mask = 0xFFFFU;
        rxArray[i].object = NULL;
        rxArray[i].CANrx_callback = NULL;
    }
    for (uint16_t i = 0U; i < txSize; i++) {
        txArray[i].bufferFull = false;
    }

